Тестовая_база_ERP_14/src/DataProcessors/АГ_ИнтерактивныйРабочийСтолТендеры/АГ_ИнтерактивныйРабочийСтолТендеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АГ_ИнтерактивныйРабочийСтолТендеры</name>
</mdclass:DataProcessor>

Тестовая_база_ERP_14/src/Enums/АГ_СтатусТендера/АГ_СтатусТендера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АГ_СтатусТендера</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеРезультата</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеАукциона</name>
  </enumValues>
  <enumValues>
    <name>ОтказОтУчастия</name>
  </enumValues>
  <enumValues>
    <name>Победа</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Поражение</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаНеСостоялась</name>
  </enumValues>
  <enumValues>
    <name>ПодготовкаТКП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеТКП</name>
  </enumValues>
  <enumValues>
    <name>НазначениеМенеджера</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ПодачаДокументов</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/АГ_Тендер/АГ_Тендер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_Тендер</name>
  <registerRecords>InformationRegister.АГ_ИсторияТендеров</registerRecords>
  <attributes>
    <name>НомерЗакупки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагТендера</name>
    <type>
      <types>EnumRef.АГ_ШагиТендера</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПубликации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОПЗ</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияДоговора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодведенияИтогов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аукцион</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАукциона</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НМЦ</name>
    <comment>Начальная минимальная цена лота</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПревышениеНМЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПродавец</name>
    <type>
      <types>EnumRef.АГ_ОрганизацияПродавец</types>
    </type>
  </attributes>
  <attributes>
    <name>НашеЦеновоеПредложение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакупкаДляМСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеДоговора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГОЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПодачиПредложения</name>
    <type>
      <types>EnumRef.АГ_ВидПодачиПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортамент</name>
    <type>
      <types>EnumRef.АГ_Сортамент</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭТП</name>
    <type>
      <types>CatalogRef.АГ_ЭлектронныеТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРаспределение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаМониторинг</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТендера</name>
    <type>
      <types>EnumRef.АГ_СтатусТендера</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиОЭТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогиМП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНеучастия</name>
    <type>
      <types>CatalogRef.АГ_ПричиныНеучастияВТендере</types>
    </type>
  </attributes>
  <attributes>
    <name>Победитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоннажПобеды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПобеды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЗаключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметИОсобенностиЗакупки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПротокола</name>
    <type>
      <types>CatalogRef.АГ_ТендерПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйКураторОЭТ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РегионПоставки</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеЗаявкиПримечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбеспечениеДоговораПримечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КритерииОценки</name>
    <attributes>
      <name>КритерийОценки</name>
      <type>
        <types>CatalogRef.АГ_КритерииОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Шаг</name>
      <type>
        <types>EnumRef.АГ_ШагиТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСтатуса</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСогласования</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.АГ_РолиСогласованияТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.АГ_РезультатСогласованияТендера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеучастия</name>
      <type>
        <types>CatalogRef.АГ_ПричиныНеучастияВТендере</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеПоЗаявке</name>
    <attributes>
      <name>ПрисоединенныйФайл</name>
      <type>
        <types>CatalogRef.АГ_ТендерПрисоединенныеФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/DataProcessors/АГ_ИнтерактивныйРабочийСтолТендеры/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьЦветомОбозначениеСтатусовПриИзменении(Элемент)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ТендерыПриАктивизацииСтроки(Элемент)
	
	ОбновитьБлокИнформации();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьВЭксель(Команда)
	ОткрытьФорму("Обработка.АГ_ИнтерактивныйРабочийСтолТендеры.Форма.ФормаВыгрузки",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлы(Команда)
	
	ТекущийТендер	= Элементы.Тендеры.ТекущиеДанные.Ссылка;
	
	ЗначениеОтбора  = Новый Структура("ВладелецФайла", ТекущийТендер);
	ПараметрыВыбора = Новый Структура("Отбор", ЗначениеОтбора);
	ПараметрыВыбора.Вставить("ЗаголовокФормы","Файлы по документу:"+ТекущийТендер);
	ОткрытьФорму("Справочник.АГ_ТендерПрисоединенныеФайлы.Форма.ФормаПросмотраПеречняФайлов", ПараметрыВыбора);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоСтатистике(Команда)
	
	ТекущийТендер	= Элементы.Тендеры.ТекущиеДанные;
	Если ТекущийТендер=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	
	Отбор = Новый Структура("Партнер", ТекущийТендер.Партнер);
	ПараметрыОткрытия.Вставить("Отбор",Отбор);
	
	
	ФормаОтчета = ПолучитьФорму("Отчет.АГ_ИсторияТендеров.Форма", ПараметрыОткрытия,ЭтаФорма);
    НовыеПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
    ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(НовыеПользовательскиеНастройки);
    ОткрытьФорму(ФормаОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Тендеры.УсловноеОформление.Элементы.Очистить();
	
	
	//Тендеры у которых от текущей даты до даты ОПЗ меньше суток выделять красным шрифтом
	
	ЭлементУсловногоОформления = Тендеры.УсловноеОформление.Элементы.Добавить();

	ГруппаЭлементовОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОПЗ");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса()+3600*24;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОПЗ");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Томатный);
	
	//Тендеры у которых меньше суток до даты контрольного ответа – выделять зеленым шрифтом
	
	ЭлементУсловногоОформления = Тендеры.УсловноеОформление.Элементы.Добавить();

	ГруппаЭлементовОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрольнаяДатаОтвета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса()+3600*24;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрольнаяДатаОтвета");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = ТекущаяДатаСеанса();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ЛимонноЗеленый);
	
	Если ВыделитьЦветомОбозначениеСтатусов Тогда
		//победы с желтым фоном
		
		ЭлементУсловногоОформления = Тендеры.УсловноеОформление.Элементы.Добавить();
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусТендера");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.АГ_СтатусТендера.Победа;
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБлокИнформации()
	
	ТекущийТендер	= Элементы.Тендеры.ТекущиеДанные;
	Если ТекущийТендер<>Неопределено Тогда
		СтруктураСвойств	= СтруктураСвойствТендера(ТекущийТендер.Ссылка);
	
		ЗаполнитьЗначенияСвойств(ЭтаФорма,СтруктураСвойств);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураСвойствТендера(ТекущийТендер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АГ_Тендер.Организация КАК Организация,
		|	АГ_Тендер.ДатаПубликации КАК ДатаПубликации,
		|	АГ_Тендер.КонтрольнаяДатаОтвета КАК КонтрольнаяДатаОтвета,
		|	АГ_Тендер.ОПЗ КАК ОПЗ,
		|	АГ_Тендер.ДатаЗаключенияДоговора КАК ДатаЗаключенияДоговора,
		|	АГ_Тендер.ДатаПодведенияИтогов КАК ДатаПодведенияИтогов,
		|	АГ_Тендер.НМЦ КАК НМЦ,
		|	АГ_Тендер.ПериодПоставки КАК ПериодПоставки,
		|	АГ_Тендер.УсловияОплаты КАК УсловияОплаты,
		|	АГ_Тендер.ЗакупкаДляМСП КАК ЗакупкаДляМСП,
		|	АГ_Тендер.ОбеспечениеЗаявки КАК ОбеспечениеЗаявки,
		|	АГ_Тендер.ОбеспечениеДоговора КАК ОбеспечениеДоговора,
		|	АГ_Тендер.ГОЗ КАК ГОЗ,
		|	АГ_Тендер.ВидПодачиПредложения КАК ВидПодачиПредложения,
		|	АГ_Тендер.Сортамент КАК Сортамент
		|ИЗ
		|	Документ.АГ_Тендер КАК АГ_Тендер
		|ГДЕ
		|	АГ_Тендер.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АГ_ТендерКритерииОценки.КритерийОценки КАК КритерийОценки,
		|	АГ_ТендерКритерииОценки.Процент КАК Процент
		|ИЗ
		|	Документ.АГ_Тендер.КритерииОценки КАК АГ_ТендерКритерииОценки
		|ГДЕ
		|	АГ_ТендерКритерииОценки.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	АГ_ТендерКритерииОценки.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийТендер);
	
	мРезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураСтвойств	= ОбщегоНазначения.ТаблицаЗначенийВМассив(мРезультатЗапроса[0].Выгрузить())[0];
	
	КритерииОценки	= "";
	ВыборкаДетальныеЗаписи = мРезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ПустаяСтрока(КритерииОценки) Тогда
			КритерииОценки	= КритерииОценки+", ";	
		КонецЕсли;	
		КритерииОценки	= КритерииОценки+ВыборкаДетальныеЗаписи.КритерийОценки+" "+ВыборкаДетальныеЗаписи.Процент+" % ";
	КонецЦикла;
	
	СтруктураСтвойств.Вставить("КритерииОценки",КритерииОценки);
	
	Возврат СтруктураСтвойств;
	
КонецФункции	

&НаКлиенте
Процедура ОткрытьОтчетАнализРаботыСТендерами(Команда)
	
	ФормаОтчета = ПолучитьФорму("Отчет.АГ_АнализРаботыСТендерами.Форма", ,ЭтаФорма);
    ОткрытьФорму(ФормаОтчета);
	
КонецПроцедуры


#КонецОбласти
